"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Есть список с сотрудниками.

Необходимо отредактировать функцию list_length таким образом, чтобы
можно было узнать количество сотрудников в компании
"""
user_list = [
    "Афанасий Петрович",
    "Олег Викторович",
    "Ольга Олеговна",
    "Анна Сергеевна"
]


def list_length(collection: list) -> int:
    # TODO написать код ниже
    result = len(collection)
    return result


if __name__ == '__main__':
    print(f"В компании работает {list_length(user_list)} человек")
